#include "array.cpp"
#include <iostream>

/* 
Варіант 16.
Обчислити:
1. Кількість елементів масиву, що лежать в діапазоні від А до В включно.
2. Суму елементів масиву, розташованих після останнього максимального елемента.
*/

int main() {
    // створюємо об'єкт класу Array
    // передаємо у конкструктор довжину, та аллокований динамічний масив 
    Array array = Array(10, new int[10]()); 
    // Вводимо значення об'єкту Array 
    array.enter();
    // Виводимо суму після останнього максимального числа у масиві 
    std::cout << " sum after max: " <<  array.sumAfterLastMax() << "\n";
    // Рахуємо кількість чисел у діапазоні від 1 до 5 
    std::cout << " count in range 1-5: " << array.count(1, 5) << "\n";
    // Виводимо масив 
    array.print();
    // видаляємо об'єкт класу Array 
    delete &array;
}